app/Controllers/AuthController.php

    public function login()
    {
        helper(['form', 'url']);

        if ($this->request->getMethod() == 'post') {
            $rules = [
                'username' => 'required',
                'password' => 'required'
            ];

            $errors = [
                'username' => [
                    'required' => 'Username harus diisi.'
                ],
                'password' => [
                    'required' => 'Password harus diisi.'
                ]
            ];

            if (!$this->validate($rules, $errors)) {
                return view('auth/login', [
                    'validation' => $this->validator
                ]);
            } else {
                $pm = new PenggunaModel();
                $username = $this->request->getPost('username');
                $password = $this->request->getPost('password');

                $user = $pm->where('username', $username)->first();
---
SELECT *
FROM `tb_pengguna`
WHERE `username` = 'admin'
 LIMIT 1