app/Controllers/PenerimaanInventarisController.php

                ];

                // Simpan data inventaris ke database
                $inv_mod->insert($dataInventaris);
---
INSERT INTO `inventaris` (`no_inventaris`, `kode_barang`, `asal_barang`, `tgl_pengadaan`, `harga`, `status_barang`) VALUES ('INV-2024-09-20-001', '000001', 'Beli', '2024-09-20', '1300000', 'Ada')