app/Models/AkunBayarModel.php

SELECT *
FROM `akun_bayar`
---
    public function getData()
    {
        return $this->findAll();