app/Models/InventarisModel.php

SELECT `inventaris`.*
FROM `inventaris`
WHERE `no_inventaris` LIKE 'INV-2024-09-20%' ESCAPE '!'
ORDER BY `no_inventaris` DESC
 LIMIT 1
---
    public function getNoInventarisLast($tanggal)
    {
        if ($tanggal === null) {
            $tanggal = date('Ymd'); // Format tanggal default
        }
        return $this->select('inventaris.*')
            ->like('no_inventaris', 'INV-' . $tanggal, 'after')
            ->orderBy('no_inventaris', 'DESC')
            ->limit(1)
            ->first();

SELECT `inventaris`.*, `inventaris_barang`.*
FROM `inventaris`
JOIN `inventaris_barang` ON `inventaris`.`kode_barang`=`inventaris_barang`.`kode_barang`
WHERE `no_inventaris` = 'I000000001'
---
    public function getDataById($id)
    {
        return $this->select('inventaris.*, inventaris_barang.*, inventaris_ruang.*')
            ->join('inventaris_barang', 'inventaris.kode_barang=inventaris_barang.kode_barang')
            ->join('inventaris_ruang', 'inventaris.id_ruang=inventaris_ruang.id_ruang')
            ->where('no_inventaris', $id)
            ->findAll(); // retrieve all data

SELECT `inventaris`.*, `inventaris_barang`.*
FROM `inventaris`
JOIN `inventaris_barang` ON `inventaris`.`kode_barang`=`inventaris_barang`.`kode_barang`
---
    public function getData()
    {
        return $this->select('inventaris.*, inventaris_barang.*')
            ->join('inventaris_barang', 'inventaris.kode_barang=inventaris_barang.kode_barang')
            ->findAll(); // retrieve all data