app/Models/InventarisBarangModel.php

SELECT *
FROM `inventaris_barang`
---
    public function getData()
    {
        return $this->findAll(); // retrieve all data

SELECT `inventaris_barang`.*, `inventaris_produsen`.*, `inventaris_merk`.*, `inventaris_jenis`.*
FROM `inventaris_barang`
JOIN `inventaris_produsen` ON `inventaris_barang`.`kode_produsen`=`inventaris_produsen`.`kode_produsen`
JOIN `inventaris_merk` ON `inventaris_barang`.`id_merk`=`inventaris_merk`.`id_merk`
JOIN `inventaris_jenis` ON `inventaris_barang`.`id_jenis`=`inventaris_jenis`.`id_jenis`
WHERE `inventaris_barang`.`kode_barang` = 'BI00000003'
 LIMIT 1
---
    public function getDataByKode($id)
    {
        return $this->select('inventaris_barang.*,inventaris_produsen.*, inventaris_merk.*,inventaris_jenis.*')
        ->join('inventaris_produsen','inventaris_barang.kode_produsen=inventaris_produsen.kode_produsen')
        ->join('inventaris_merk','inventaris_barang.id_merk=inventaris_merk.id_merk')
        ->join('inventaris_jenis','inventaris_barang.id_jenis=inventaris_jenis.id_jenis')
        ->where('inventaris_barang.kode_barang', $id)->first();