app/Models/IpsrsBarangModel.php

    public function getData()
    {
        return $this->select('ipsrsbarang.*, ipsrsjenisbarang.*')
            ->join('ipsrsjenisbarang', 'ipsrsbarang.jenis=ipsrsjenisbarang.kd_jenis')
            ->findAll(); // retrieve all data
---
SELECT `ipsrsbarang`.*, `ipsrsjenisbarang`.*
FROM `ipsrsbarang`
JOIN `ipsrsjenisbarang` ON `ipsrsbarang`.`jenis`=`ipsrsjenisbarang`.`kd_jenis`

    public function getDataByKode($kode_barang)
    {
        return $this->select('ipsrsbarang.kode_brng, ipsrsbarang.nama_brng, ipsrsbarang.kode_sat, ipsrsjenisbarang.nm_jenis, ipsrsbarang.harga')
            ->join('ipsrsjenisbarang', 'ipsrsbarang.jenis = ipsrsjenisbarang.kd_jenis')
            ->where('ipsrsbarang.kode_brng', $kode_barang)
            ->first();
---
SELECT `ipsrsbarang`.`kode_brng`, `ipsrsbarang`.`nama_brng`, `ipsrsbarang`.`kode_sat`, `ipsrsjenisbarang`.`nm_jenis`, `ipsrsbarang`.`harga`
FROM `ipsrsbarang`
JOIN `ipsrsjenisbarang` ON `ipsrsbarang`.`jenis` = `ipsrsjenisbarang`.`kd_jenis`
WHERE `ipsrsbarang`.`kode_brng` = 'B00001'
 LIMIT 1