app/Models/IpsrsSuplierModel.php

SELECT *
FROM `ipsrssuplier`
---
    public function getData()
    {
        return $this->findAll(); // retrieve all data