app/Models/PegawaiModel.php

    public function getData()
    {
        return $this->findAll(); // retrieve all data
---
SELECT *
FROM `pegawai`