app/Models/PembayaranInventarisModel.php

    public function getData()
    {
        return $this->select('bayar_pemesanan_inventaris.*, petugas.*, akun_bayar_hutang.*')
            ->join('petugas', 'bayar_pemesanan_inventaris.nip = petugas.nip')
            ->join('akun_bayar_hutang', 'bayar_pemesanan_inventaris.nama_bayar = akun_bayar_hutang.nama_bayar')
            ->findAll(); // Retrieve all data
---
SELECT `bayar_pemesanan_inventaris`.*, `petugas`.*, `akun_bayar_hutang`.*
FROM `bayar_pemesanan_inventaris`
JOIN `petugas` ON `bayar_pemesanan_inventaris`.`nip` = `petugas`.`nip`
JOIN `akun_bayar_hutang` ON `bayar_pemesanan_inventaris`.`nama_bayar` = `akun_bayar_hutang`.`nama_bayar`