app/Models/PembelianNonMedisDetailModel.php

    public function detailData($id)
    {
        return $this->select('ipsrsdetailbeli.*, ipsrsbarang.*, ipsrsjenisbarang.*')
            ->join('ipsrsbarang', 'ipsrsdetailbeli.kode_brng=ipsrsbarang.kode_brng')
            ->join('ipsrsjenisbarang', 'ipsrsbarang.jenis=ipsrsjenisbarang.kd_jenis')
            ->where('no_faktur', $id)
            ->findAll(); // retrieve all data
---
SELECT `ipsrsdetailbeli`.*, `ipsrsbarang`.*, `ipsrsjenisbarang`.*
FROM `ipsrsdetailbeli`
JOIN `ipsrsbarang` ON `ipsrsdetailbeli`.`kode_brng`=`ipsrsbarang`.`kode_brng`
JOIN `ipsrsjenisbarang` ON `ipsrsbarang`.`jenis`=`ipsrsjenisbarang`.`kd_jenis`
WHERE `no_faktur` = 'ADI123'