app/Models/PembelianNonMedisModel.php

SELECT `ipsrspembelian`.*, `petugas`.*, `ipsrssuplier`.*, `rekening`.*
FROM `ipsrspembelian`
JOIN `petugas` ON `ipsrspembelian`.`nip` = `petugas`.`nip`
JOIN `ipsrssuplier` ON `ipsrspembelian`.`kode_suplier` = `ipsrssuplier`.`kode_suplier`
JOIN `rekening` ON `ipsrspembelian`.`kd_rek` = `rekening`.`kd_rek`
ORDER BY `tgl_beli` DESC
---
    public function getData()
    {
        return $this->select('ipsrspembelian.*, petugas.*, ipsrssuplier.*, rekening.*')
            ->join('petugas', 'ipsrspembelian.nip = petugas.nip')
            ->join('ipsrssuplier', 'ipsrspembelian.kode_suplier = ipsrssuplier.kode_suplier')
            ->join('rekening', 'ipsrspembelian.kd_rek = rekening.kd_rek')
            ->orderBy('tgl_beli', 'DESC')
            ->findAll(); // Retrieve all data

SELECT `ipsrspembelian`.*, `petugas`.*, `ipsrssuplier`.*, `rekening`.*
FROM `ipsrspembelian`
JOIN `petugas` ON `ipsrspembelian`.`nip` = `petugas`.`nip`
JOIN `ipsrssuplier` ON `ipsrspembelian`.`kode_suplier` = `ipsrssuplier`.`kode_suplier`
JOIN `rekening` ON `ipsrspembelian`.`kd_rek` = `rekening`.`kd_rek`
WHERE `no_faktur` = 'adi'
---
    public function getDataById($id)
    {
        return $this->select('ipsrspembelian.*, petugas.*, ipsrssuplier.*, rekening.*')
            ->join('petugas', 'ipsrspembelian.nip = petugas.nip')
            ->join('ipsrssuplier', 'ipsrspembelian.kode_suplier = ipsrssuplier.kode_suplier')
            ->join('rekening', 'ipsrspembelian.kd_rek = rekening.kd_rek')
            ->where('no_faktur', $id)
            ->findAll(); // retrieve all data