app/Models/PembelianInventarisModel.php

    public function getData()
    {
        return $this->select('inventaris_pembelian.*, petugas.*, inventaris_suplier.*')
        ->join('petugas','inventaris_pembelian.nip=petugas.nip')
        ->join('inventaris_suplier','inventaris_pembelian.kode_suplier=inventaris_suplier.kode_suplier')
        ->findAll(); // retrieve all data
---
SELECT `inventaris_pembelian`.*, `petugas`.*
FROM `inventaris_pembelian`
JOIN `petugas` ON `inventaris_pembelian`.`nip`=`petugas`.`nip`
JOIN `inventaris_suplier` ON `inventaris_pembelian`.`kode_suplier`=`inventaris_suplier`.`kode_suplier`

    public function getDataById($id)
    {
        return $this->select('inventaris_pembelian.*, petugas.*, inventaris_suplier.*')
        ->join('petugas','inventaris_pembelian.nip=petugas.nip')
        ->join('inventaris_suplier','inventaris_pembelian.kode_suplier=inventaris_suplier.kode_suplier')
        ->where('no_faktur', $id)
        ->findAll(); // retrieve all data
---
SELECT `inventaris_pembelian`.*, `petugas`.*, `inventaris_suplier`.*
FROM `inventaris_pembelian`
JOIN `petugas` ON `inventaris_pembelian`.`nip`=`petugas`.`nip`
JOIN `inventaris_suplier` ON `inventaris_pembelian`.`kode_suplier`=`inventaris_suplier`.`kode_suplier`
WHERE `no_faktur` = '2024Mantap'