app/Models/PembelianInventarisDetailModel.php

SELECT `inventaris_detail_beli`.*, `inventaris_barang`.*, `inventaris_produsen`.*, `inventaris_merk`.*, `inventaris_jenis`.*
FROM `inventaris_detail_beli`
JOIN `inventaris_barang` ON `inventaris_detail_beli`.`kode_barang`=`inventaris_barang`.`kode_barang`
JOIN `inventaris_produsen` ON `inventaris_barang`.`kode_produsen`=`inventaris_produsen`.`kode_produsen`
JOIN `inventaris_merk` ON `inventaris_barang`.`id_merk`=`inventaris_merk`.`id_merk`
JOIN `inventaris_jenis` ON `inventaris_barang`.`id_jenis`=`inventaris_jenis`.`id_jenis`
WHERE `no_faktur` = '2024Mantap'
---
    public function detailData($id)
    {
        return $this->select('inventaris_detail_beli.*, inventaris_barang.*, inventaris_produsen.*, inventaris_merk.*, inventaris_jenis.*')
        ->join('inventaris_barang','inventaris_detail_beli.kode_barang=inventaris_barang.kode_barang')
        ->join('inventaris_produsen','inventaris_barang.kode_produsen=inventaris_produsen.kode_produsen')
        ->join('inventaris_merk','inventaris_barang.id_merk=inventaris_merk.id_merk')
        ->join('inventaris_jenis','inventaris_barang.id_jenis=inventaris_jenis.id_jenis')
        ->where('no_faktur', $id)
        ->findAll(); // retrieve all data