app/Models/PenerimaanNonMedisModel.php

SELECT `ipsrspemesanan`.*, `petugas`.*, `inventaris_suplier`.*
FROM `ipsrspemesanan`
JOIN `petugas` ON `ipsrspemesanan`.`nip` = `petugas`.`nip`
JOIN `inventaris_suplier` ON `ipsrspemesanan`.`kode_suplier` = `inventaris_suplier`.`kode_suplier`
ORDER BY `tgl_pesan` DESC
---
    public function getData()
    {
        return $this->select('ipsrspemesanan.*, petugas.*, inventaris_suplier.*')
            ->join('petugas', 'ipsrspemesanan.nip = petugas.nip')
            ->join('inventaris_suplier', 'ipsrspemesanan.kode_suplier = inventaris_suplier.kode_suplier')
            ->orderBy('tgl_pesan', 'DESC')
            ->findAll(); // Retrieve all data