app/Models/PenerimaanInventarisModel.php

SELECT `inventaris_pemesanan`.*, `petugas`.*, `inventaris_suplier`.*, `rekening`.*
FROM `inventaris_pemesanan`
JOIN `petugas` ON `inventaris_pemesanan`.`nip` = `petugas`.`nip`
JOIN `inventaris_suplier` ON `inventaris_pemesanan`.`kode_suplier` = `inventaris_suplier`.`kode_suplier`
JOIN `rekening` ON `inventaris_pemesanan`.`kd_rek_aset` = `rekening`.`kd_rek`
---
    public function getData()
    {
        return $this->select('inventaris_pemesanan.*, petugas.*, inventaris_suplier.*, rekening.*')
            ->join('petugas', 'inventaris_pemesanan.nip = petugas.nip')
            ->join('inventaris_suplier', 'inventaris_pemesanan.kode_suplier = inventaris_suplier.kode_suplier')
            ->join('rekening ', 'inventaris_pemesanan.kd_rek_aset = rekening.kd_rek')
            ->findAll(); // Retrieve all data