app/Models/PenggunaModel.php

    public function getData()
    {
        return $this->findAll(); // retrieve all data
---
SELECT *
FROM `tb_pengguna`