app/Models/PengajuanBarangNonMedisModel.php

SELECT `pengajuan_barang_nonmedis`.*, `pegawai`.*
FROM `pengajuan_barang_nonmedis`
JOIN `pegawai` ON `pengajuan_barang_nonmedis`.`nip`=`pegawai`.`nik`
---
    public function getData()
    {
        return $this->select('pengajuan_barang_nonmedis.*, pegawai.*')
        ->join('pegawai','pengajuan_barang_nonmedis.nip=pegawai.nik')
        ->findAll(); // retrieve all data

INSERT INTO `pengajuan_barang_nonmedis` (`no_pengajuan`, `nip`, `tanggal`, `status`, `keterangan`) VALUES ('PNM234', '12/09/1988/001', '2024-10-12', 'Proses Pengajuan', 'gak ada')
---
    public function insertData($data)
    {
        return $this->insert($data); // insert data