app/Models/PengajuanInventarisModel.php

SELECT `pengajuan_inventaris`.*, `pegawai`.*, `pj`.`nik` as `nik_pj`, `pj`.`nama` as `nama_pj`
FROM `pengajuan_inventaris`
JOIN `pegawai` ON `pengajuan_inventaris`.`nik`=`pegawai`.`nik`
JOIN `pegawai` as `pj` ON `pengajuan_inventaris`.`nik_pj`=`pj`.`nik`
---
    public function getData()
    {
        return $this->select('pengajuan_inventaris.*, pegawai.*')
        ->join('pegawai','pengajuan_inventaris.nik=pegawai.nik')
        ->join('pegawai as pj','pengajuan_inventaris.nik_pj=pj.nik')
        ->select('pj.nik as nik_pj,pj.nama as nama_pj')
        ->findAll(); // retrieve all data

SELECT `pengajuan_inventaris`.*, `pegawai`.*, `pj`.`nik` as `nik_pj`, `pj`.`nama` as `nama_pj`
FROM `pengajuan_inventaris`
JOIN `pegawai` ON `pengajuan_inventaris`.`nik`=`pegawai`.`nik`
JOIN `pegawai` as `pj` ON `pengajuan_inventaris`.`nik_pj`=`pj`.`nik`
WHERE `tanggal` >= '2024-09-03'
AND `tanggal` <= '2024-09-03'
AND `pengajuan_inventaris`.`nik` = '010101'
---
    public function printData($tanggal_awal, $tanggal_akhir, $nik = null)
    {
        $builder = $this->select('pengajuan_inventaris.*, pegawai.*')
        ->join('pegawai','pengajuan_inventaris.nik=pegawai.nik')
        ->join('pegawai as pj','pengajuan_inventaris.nik_pj=pj.nik')
        ->select('pj.nik as nik_pj,pj.nama as nama_pj')
        ->where('tanggal >=' , $tanggal_awal)
        ->where('tanggal <=' , $tanggal_akhir);
        if ($nik != null){
            $builder->where('pengajuan_inventaris.nik', $nik);
        }
        return $builder->findAll(); // retrieve all data