app/Models/PengeluaranNonMedisModel.php

    public function getData()
    {
        return $this->select('ipsrspengeluaran.*, petugas.*')
            ->join('petugas', 'ipsrspengeluaran.nip = petugas.nip')
            ->findAll(); // Retrieve all data
---
SELECT `ipsrspengeluaran`.*, `petugas`.*
FROM `ipsrspengeluaran`
JOIN `petugas` ON `ipsrspengeluaran`.`nip` = `petugas`.`nip`