app/Models/PermintaanBarangNonMedisModel.php

SELECT `permintaan_non_medis`.*, `pegawai`.*
FROM `permintaan_non_medis`
JOIN `pegawai` ON `permintaan_non_medis`.`nip`=`pegawai`.`nik`
---
    public function getData()
    {
        return $this->select('permintaan_non_medis.*, pegawai.*')
            ->join('pegawai', 'permintaan_non_medis.nip=pegawai.nik', )
            ->findAll(); // retrieve all data