app/Models/PetugasModel.php

SELECT *
FROM `petugas`
---
    public function getData()
    {
        return $this->findAll(); // retrieve all data