app/Models/RekeningModel.php

    public function getData()
    {
        return $this->select('rekening.*')
        ->like('kd_rek', '1231')
        ->findAll();
---
SELECT `rekening`.*
FROM `rekening`
WHERE `kd_rek` LIKE '%1231%' ESCAPE '!'