app/Models/RuangModel.php

SELECT `inventaris_ruang`.*
FROM `inventaris_ruang`
---
    public function getData()
    {
        return $this->select('inventaris_ruang.*')
            ->findAll(); // retrieve all data